src/DataProcessors/СопоставлениеАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СопоставлениеАлкогольнойПродукцииЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/КлассификаторАлкогольнойПродукцииЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КлассификаторАлкогольнойПродукцииЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упакована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запросить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/СопоставлениеАлкогольнойПродукцииЕГАИС/Forms/ФормаСопоставления/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АлкогольнаяПродукция = Параметры.АлкогольнаяПродукция;
	Номенклатура		 = Параметры.Номенклатура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Производитель,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.НаименованиеПолное,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Упакована,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Объем,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Крепость
	|ИЗ
	|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК КлассификаторАлкогольнойПродукцииЕГАИС
	|ГДЕ
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", АлкогольнаяПродукция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Элементы.ПолноеНаименование.Заголовок = СокрЛП(Выборка.НаименованиеПолное);
		
		ВидПродукции  = Выборка.ВидПродукции;
		Производитель = Выборка.Производитель;
		Упакована     = Выборка.Упакована;
		Объем         = Выборка.Объем;
		Крепость      = Выборка.Крепость;
		
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.ВидАлкогольнойПродукции КАК ВидПродукции,
	|	ТаблицаНоменклатура.Производитель,
	|	ТаблицаНоменклатура.Объем КАК Объем,
	|	ТаблицаНоменклатура.Крепость КАК Крепость
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВидПродукцииНоменклатура  = Выборка.ВидПродукции;
		ПроизводительНоменклатура = Выборка.Производитель;
		ОбъемНоменклатура         = Выборка.Объем;
		КрепостьНоменклатура      = Выборка.Крепость;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДиалогом();
КонецПроцедуры


&НаКлиенте
Процедура УправлениеДиалогом()
	
	ПроизводительКонтрагент = Неопределено;//ПолучитьПроизводителяДляКлассификатора(Производитель);
	
	Элементы.ПредупреждениеОбъем.Видимость         = (НЕ Объем = ОбъемНоменклатура);
	Элементы.ПредупреждениеВидПродукции.Видимость  = (НЕ ВидПродукции = ВидПродукцииНоменклатура);
	Элементы.ПредупреждениеКрепость.Видимость      = (НЕ Крепость = КрепостьНоменклатура);
	
	Элементы.ПредупреждениеПроизводитель.Видимость = ((НЕ ЗначениеЗаполнено(ПроизводительКонтрагент)) ИЛИ (НЕ ПроизводительКонтрагент = ПроизводительНоменклатура));
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	
	ЕстьРасхождения = Ложь;
	
	//ПроизводительКонтрагент = ПолучитьПроизводителяДляКлассификатора(Производитель);
	
	Если (НЕ Объем = ОбъемНоменклатура) Тогда
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	Если (НЕ ВидПродукции = ВидПродукцииНоменклатура) Тогда
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	Если (НЕ Крепость = КрепостьНоменклатура) Тогда
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	//Если (НЕ ЗначениеЗаполнено(ПроизводительКонтрагент)) ИЛИ (НЕ ПроизводительКонтрагент = ПроизводительНоменклатура) Тогда
	//	ЕстьРасхождения = Истина;
	//КонецЕсли;
	
	Если ЕстьРасхождения Тогда
		
		ТекстВопроса = НСтр("ru='У алкогольной продукции и номенклатуры есть расхождения по ключевым полям. Зафиксировать сопоставление?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗафиксироватьСопоставление", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
		Если Вопрос("У алкогольной продукции и номенклатуры есть расхождения по ключевым полям.
			|Зафиксировать сопоставление?", РежимДиалогаВопрос.ДаНет,,,"Подтверждение сопоставления")=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СопоставитьНаСервере();
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьСопоставление(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СопоставитьНаСервере();
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьНаСервере()
	
	НаборЗаписей = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.АлкогольнаяПродукция.Использование = Истина;
	НаборЗаписей.Отбор.АлкогольнаяПродукция.Значение = АлкогольнаяПродукция;
	
	НаборЗаписей.Отбор.ИдентификаторУпаковки.Использование = Истина;
	НаборЗаписей.Отбор.ИдентификаторУпаковки.Значение = ИдентификаторУпаковки;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()>0 Тогда
		
	КонецЕсли;
	НаборЗаписей.Очистить();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.АлкогольнаяПродукция	= АлкогольнаяПродукция;
	НоваяЗапись.ИдентификаторУпаковки	= ИдентификаторУпаковки;
	НоваяЗапись.Номенклатура			= Номенклатура;
	НоваяЗапись.Характеристика			= Характеристика;
	НоваяЗапись.ЕдиницаИзмерения		= ЕдиницаИзмерения;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
